; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=24, out_folder=htg/blocksworld/training, instance_id=4, seed=2028, goal_proportion=0.1

(define (problem blocksworld-04)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b3)
    (on b3 b20)
    (on b20 b4)
    (on b4 b8)
    (on b8 b2)
    (on b2 b15)
    (on b15 b16)
    (on-table b16)
    (clear b13)
    (on b13 b11)
    (on b11 b17)
    (on b17 b19)
    (on b19 b18)
    (on b18 b14)
    (on b14 b10)
    (on b10 b5)
    (on b5 b7)
    (on b7 b22)
    (on b22 b23)
    (on b23 b9)
    (on b9 b21)
    (on-table b21)
    (clear b24)
    (on b24 b1)
    (on b1 b6)
    (on b6 b12)
    (on-table b12))
 (:goal  (and 
    (clear b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b24 b1)
   deleted: (on b24 b1) (clear b24) (arm-empty)
   added: (holding b24) (clear b1)
   goals met: 0 of 3
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 3
3. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 0 of 3
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 3
5. (unstack b3 b20)
   deleted: (on b3 b20) (clear b3) (arm-empty)
   added: (holding b3) (clear b20)
   goals met: 1 of 3
6. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 3
7. (unstack b20 b4)
   deleted: (on b20 b4) (clear b20) (arm-empty)
   added: (holding b20) (clear b4)
   goals met: 1 of 3
8. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 3
9. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 1 of 3
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 3
11. (unstack b8 b2)
   deleted: (on b8 b2) (clear b8) (arm-empty)
   added: (holding b8) (clear b2)
   goals met: 2 of 3
12. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 3
13. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 1 of 3
14. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 3
